Repository: benjaminli7/challenge2-5iw
Catalog: frontend/lib/l10n/app_*.arb
Languages: fr

source: Hello World!
fr: Bonjour le monde

source: Login
fr: Connexion

# logInSuccess
source: You have successfully logged in!
fr: Connexion réussie

# logInFailure
source: Login failed. Please try again.
fr: Erreur de connexion

# logInFailureGoogle2
source: Failed to connect with Google2
fr: Erreur de connexion Google2

# connectedGoogle
source: Connected with Google
fr: Connecté avec Google

# logInFailureGoogle3
source: Failed to connect with Google3
fr: Erreur de connexion Google3

source: Password
fr: Mot de passe

# signInGoogle
source: Sign in with Google
fr: Connexion avec Google

# notAccount
source: No account yet? Sign up
fr: Pas de compte ? Inscription

# signUpSuccess
source: Signup successful
fr: Inscription réussie

# signUpFailure
source: Signup failed
fr: Erreur d'inscription

source: Sign Up
fr: Inscription

# alreadyRegister
source: Already registered? Login here.
fr: Déjà inscrit ? Connexion

source: Users
fr: Utilisateurs

source: Hike
fr: Randonnées

source: Settings
fr: Paramètres

source: Hike details
fr: Détails de la randonnée

# hikeName
source: Name {name}
fr: Nom {name}

# hikeDifficulty
source: Difficulty {difficulty}
fr: Difficulté {difficulty}

# hikeDuration
source: Duration {duration}
fr: Durée {duration}

# hikeValidation
source: Validation
fr: Validée

# hikeValidationPannel
source: Hikes validation Panel
fr: Validation des randonnées

source: No hikes found
fr: Aucune randonnée trouvée

source: Name
fr: Nom

# userDetail
source: User details
fr: Détails de l'utilisateur

# userIsValide
source: Is valide {isValide}
fr: Valide? {isValide}

source: Delete user
fr: Supprimer l'utilisateur

# upgradeAdmin
source: Upgrade to admin
fr: Promouvoir en admin

source: User list
fr: Liste des utilisateurs

source: No users found
fr: Aucun utilisateur trouvé

source: Is valide
fr: Valide

source: Create hike
fr: Créé une randonnée

# enterNameHike
source: Please enter the name of the hike
fr: S'il vous plaît entrer le nom de la randonnée

# nameHike50
source: Name cannot be longer than 50 characters
fr: Le nom ne peut pas dépasser 50 caractères

# nameHikeAlpha
source: Name can only contain alphanumeric characters and spaces
fr: Le nom ne peut contenir que des lettres

# enterDescriptionHike
source: Please enter the description of the hike
fr: S'il vous plaît entrer la description de la randonnée

# descriptionHike50
source: Description cannot be longer than 50 characters
fr: La description ne peut pas dépasser 50 caractères

source: Difficulty
fr: Difficulté

source: Easy
fr: Facile

source: Moderate
fr: Modéré

source: Hard
fr: Difficile

# selectDifficulty
source: Please select a difficulty level
fr: Sélectionnez la difficulté

# durationHour
source: Duration (hours)
fr: Durée (en heures)

# enterDurationHike
source: Please enter the duration of the hike
fr: S'il vous plaît entrer la durée de la randonnée

# durationBetween
source: Duration must be between 0 and 96h (its not Trekking!)
fr: La durée doit être comprise entre 1 et 96 heures

# noImage
source: No image selected
fr: Aucune image sélectionnée

source: Upload image
fr: Télécharger une image

# noGpxFile
source: No gpx file selected
fr: Aucun fichier gpx sélectionné

# uploadGpx
source: Upload gpx file
fr: Télécharger un fichier gpx

source: Processing data
fr: Traitement des données

source: Submit
fr: Valider

source: GPX Route Viewer
fr: Visualiseur de route gpx

source: No data available
fr: Aucune donnée disponible

# reviewSubmit
source: Review submitted
fr: Votre avis a été soumis

# rateHike
source: Rate this hike:
fr: Note de la randonnée:

# comment
source: Comment (optional)
fr: Commentaire (Optionnel)

# commentLonger
source: Comment cannot be longer than 280 characters
fr: Le commentaire ne peut pas dépasser 280 caractères

# invalidComment
source: Invalid characters in comment
fr: Le commentaire contient des charactères invalides

source: Submit review
fr: Valider l'avis

# discoverHike
source: Discover hiking trails near you
fr: Decouvrez les randonnées pres de chez vous

# searchTrail
source: Search for a trail
fr: Rechercher une randonnée

# userNotLogged
source: User not logged in
fr: Utilisateur non connecté

# joinGroupSuccess
source: Joined group {group} successfully
fr: Groupe {group} rejoint avec succès

# joinGroupFailure
source: Failed to join group {group}: {e}
fr: Erreur lors du groupe {group}: {e}

source: Groups
fr: Groupes

# noGroupFound
source: No groups found
fr: Aucun groupe trouvé

source: Reviews
fr: Avis

# viewReviews
source: View all reviews
fr: Avis

source: Join group
fr: Rejoindre le groupe

source: Hike Reviews
fr: Avis sur la randonnée

# noReviewsFound
source: No reviews found for this hike
fr: Aucun avis trouvé

# ratingHike
source: Rating :{rating}
fr: Avis :{rating}

source: No comment provided
fr: Aucun commentaire fourni

# enterMessage
source: Enter your message
fr: Entrer un message

# groupDetail
source: Group details
fr: Détails du groupe

# startDateArg
source: Start date {startDate}
fr: Date début {startDate}

# organizerArg
source: Organizer {organizer}
fr: Organisateur {organizer}

source: Group chat
fr: Chat du groupe
